app/controllers/articles_controller.rb

  def index
    # 何も書かないとapp/views/articles/index.html.erbがレンダリングされる

    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
    p params  # リクエストパラメータ: {"id"=>"1"}
    @article = Article.find(params[:id]) # コントローラーに送られるパラメータを保持するハッシュようななオブジェクト
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    # @article = Ariticle.new(title: params[:article][:title], body: params[:article][:body])
    # これでも良いが、めんどくさいしミス増えるので、以下のように書く
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "小話"], ["body", "aaaaaaaaaaaaaaaaaaaaaaaa"], ["created_at", "2023-05-28 18:14:34.358606"], ["updated_at", "2023-05-28 18:14:34.358606"]]