app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "ぼく"], ["body", "とってもいいアドバイスでした"], ["article_id", 1], ["created_at", "2023-05-28 19:31:24.177242"], ["updated_at", "2023-05-28 19:31:24.177242"]]
---
  def create
    @article = Article.find(params[:article_id])
    # @articleに関連付けられたコメントの集合を取得している
    @comment = @article.comments.create(comment_params) # newとsaveを一緒に行うcreate。buildにするとnewのみ行われる。